distillQwen8b/log_local_3rq_20G.txt
Namespace(backend='vllm', base_url='https://vllmtest3.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20480, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, request_rate=3.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 3.0
2025-02-14 18:15:11 ERROR on: https://vllmtest3.service-inference.ai/v1/completions Bad Gateway
============ Serving Benchmark Result ============
Successful requests:                     7863      
Benchmark duration (s):                  6889.58   
Total input tokens:                      1149680   
Total generated tokens:                  1694253   
Request throughput (req/s):              1.14      
Input token throughput (tok/s):          166.87    
Output token throughput (tok/s):         245.92    
---------------Time to First Token----------------
Mean TTFT (ms):                          46709.70  
Median TTFT (ms):                        49034.09  
P99 TTFT (ms):                           50051.56  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          121.57    
Median TPOT (ms):                        102.24    
P99 TPOT (ms):                           473.50    
---------------Inter-token Latency----------------
Mean ITL (ms):                           104.50    
Median ITL (ms):                         95.13     
P99 ITL (ms):                            399.90    
==================================================