distillQwen8b/log_rdma_25rq_20G.txt
Namespace(backend='vllm', base_url='https://vllmtest2.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20480, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, request_rate=2.5, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.5
============ Serving Benchmark Result ============
Successful requests:                     8470      
Benchmark duration (s):                  8247.54   
Total input tokens:                      1286311   
Total generated tokens:                  1792705   
Request throughput (req/s):              1.03      
Input token throughput (tok/s):          155.96    
Output token throughput (tok/s):         217.36    
---------------Time to First Token----------------
Mean TTFT (ms):                          46423.65  
Median TTFT (ms):                        48804.83  
P99 TTFT (ms):                           50059.41  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          135.95    
Median TPOT (ms):                        114.48    
P99 TPOT (ms):                           532.04    
---------------Inter-token Latency----------------
Mean ITL (ms):                           117.22    
Median ITL (ms):                         98.62     
P99 ITL (ms):                            409.99    
==================================================