distillQwen8b/log_rdma_7rq_20G.txt
Namespace(backend='vllm', base_url='https://vllmtest2.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20480, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, request_rate=7.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 7.0
============ Serving Benchmark Result ============
Successful requests:                     2990      
Benchmark duration (s):                  3029.77   
Total input tokens:                      314795    
Total generated tokens:                  678552    
Request throughput (req/s):              0.99      
Input token throughput (tok/s):          103.90    
Output token throughput (tok/s):         223.96    
---------------Time to First Token----------------
Mean TTFT (ms):                          47885.97  
Median TTFT (ms):                        49874.61  
P99 TTFT (ms):                           50249.84  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          158.15    
Median TPOT (ms):                        127.32    
P99 TPOT (ms):                           662.37    
---------------Inter-token Latency----------------
Mean ITL (ms):                           131.24    
Median ITL (ms):                         99.14     
P99 ITL (ms):                            562.09    
==================================================