distillQwen8b/sglang_local_35rq_24G.txt
Namespace(backend='sglang', base_url='https://sglang03.service-inference.ai', host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='deepseek-ai/DeepSeek-R1-Distill-Llama-8B', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20480, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=2048, random_output_len=128, random_range_ratio=1.0, request_rate=3.5, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 3.5
2025-03-03 15:18:43 ERROR on: https://sglang03.service-inference.ai/v1/completions Bad Gateway
2025-03-03 15:21:14 ERROR on: https://sglang03.service-inference.ai/v1/completions Bad Gateway
2025-03-03 15:35:44 ERROR on: https://sglang03.service-inference.ai/v1/completions Bad Gateway
============ Serving Benchmark Result ============
Successful requests:                     20445     
Benchmark duration (s):                  5884.74   
Total input tokens:                      4515498   
Total generated tokens:                  3960632   
Request throughput (req/s):              3.47      
Input token throughput (tok/s):          767.32    
Output token throughput (tok/s):         673.03    
---------------Time to First Token----------------
Mean TTFT (ms):                          324.59    
Median TTFT (ms):                        329.71    
P99 TTFT (ms):                           582.53    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          109.96    
Median TPOT (ms):                        108.93    
P99 TPOT (ms):                           169.13    
---------------Inter-token Latency----------------
Mean ITL (ms):                           109.41    
Median ITL (ms):                         94.05     
P99 ITL (ms):                            403.52    
==================================================